StartMilandr/MDR_Pack_v6/SVD_Files/RST/MDR1986VE4_RST.svd
        <!-- PLL CONTROL -->
        <register>
          <name>PLL_CONTROL</name>
          <description>PLL Control Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!--resetMask>0x00000FFF</resetMask--><!--#BE1,#BE3,BE9x-->
          <resetMask>0x0000020C</resetMask><!--#BE4,#BK214,#BK234-->
          <!--resetMask>0x00F30FFF</resetMask--><!--#VC1-->

          <fields>
            <!--#BE1,#BE3,#BE9x,#VC1-->
            <!--field>
              <name>PLL_USB_ON</name>
              <description>PLL USB Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__PLL__USB_EN_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>PLL Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>PLL On</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field-->
            <!--#BE1,#BE3,#BE9x,#VC1-->
            <!--field>
              <name>PLL_USB_PLD</name>
              <description>PLL USB Restart</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__PLL__USB_PLD_</headerEnumName>
                <enumeratedValue>
                  <name>RestartOff</name>
                  <description>PLL restart inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DoRestart</name>
                  <description>PLL Do Restart</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field-->
            <field>
              <name>PLL_CPU_ON</name>
              <description>PLL CPU Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__PLL__CPU_EN_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>PLL Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>PLL On</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_CPU_PLD</name>
              <description>PLL CPU Restart</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__PLL__CPU_PLD_</headerEnumName>
                <enumeratedValue>
                  <name>RestartOff</name>
                  <description>PLL restart inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DoRestart</name>
                  <description>PLL Do Restart</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!--#BE1,#BE3,#BE9x,#VC1-->
            <!--field>
              <name>PLL_USB_MUL</name>
              <description>PLL USB Mul, [x1 .. x16]</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__PLL__USB_MUL_</headerEnumName>
                <enumeratedValue><name>x1</name><description>PLL mul x1</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>x2</name><description>PLL mul x2</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>x3</name><description>PLL mul x3</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>x4</name><description>PLL mul x4</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>x5</name><description>PLL mul x5</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>x6</name><description>PLL mul x6</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>x7</name><description>PLL mul x7</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>x8</name><description>PLL mul x8</description><value>7</value></enumeratedValue>
                <enumeratedValue><name>x9</name><description>PLL mul x9</description><value>8</value></enumeratedValue>
                <enumeratedValue><name>x10</name><description>PLL mul x10</description><value>9</value></enumeratedValue>
                <enumeratedValue><name>x11</name><description>PLL mul x11</description><value>10</value></enumeratedValue>
                <enumeratedValue><name>x12</name><description>PLL mul x12</description><value>11</value></enumeratedValue>
                <enumeratedValue><name>x13</name><description>PLL mul x13</description><value>12</value></enumeratedValue>
                <enumeratedValue><name>x14</name><description>PLL mul x14</description><value>13</value></enumeratedValue>
                <enumeratedValue><name>x15</name><description>PLL mul x15</description><value>14</value></enumeratedValue>
                <enumeratedValue><name>x16</name><description>PLL mul x16</description><value>15</value></enumeratedValue>
              </enumeratedValues>
            </field-->
            <field>
              <name>PLL_CPU_MUL</name>
              <description>PLL CPU Mul, [x1 .. x16]</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__PLL__CPU_MUL_</headerEnumName>
                <enumeratedValue><name>x1</name><description>PLL mul x1</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>x2</name><description>PLL mul x2</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>x3</name><description>PLL mul x3</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>x4</name><description>PLL mul x4</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>x5</name><description>PLL mul x5</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>x6</name><description>PLL mul x6</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>x7</name><description>PLL mul x7</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>x8</name><description>PLL mul x8</description><value>7</value></enumeratedValue>
                <enumeratedValue><name>x9</name><description>PLL mul x9</description><value>8</value></enumeratedValue>
                <enumeratedValue><name>x10</name><description>PLL mul x10</description><value>9</value></enumeratedValue>
                <enumeratedValue><name>x11</name><description>PLL mul x11</description><value>10</value></enumeratedValue>
                <enumeratedValue><name>x12</name><description>PLL mul x12</description><value>11</value></enumeratedValue>
                <enumeratedValue><name>x13</name><description>PLL mul x13</description><value>12</value></enumeratedValue>
                <enumeratedValue><name>x14</name><description>PLL mul x14</description><value>13</value></enumeratedValue>
                <enumeratedValue><name>x15</name><description>PLL mul x15</description><value>14</value></enumeratedValue>
                <enumeratedValue><name>x16</name><description>PLL mul x16</description><value>15</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <!--#VC1-->
            <!--field>
              <name>PLL_DSP_ON</name>
              <description>PLL DSP Enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__PLL__DSP_EN_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>PLL Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>PLL On</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field-->
            <!--#VC1-->
            <!--field>
              <name>PLL_DSP_PLD</name>
              <description>PLL DSP Restart</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__PLL__DSP_PLD_</headerEnumName>
                <enumeratedValue>
                  <name>RestartOff</name>
                  <description>PLL restart inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DoRestart</name>
                  <description>PLL Do Restart</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field-->
            <!--#VC1-->
            <!--field derivedFrom="PLL_CPU_MUL">
              <name>PLL_DSP_MUL</name>
              <description>PLL DSP Mul, [x2 .. x16]</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field--> 

